docs/torsten_users_guide.org
#+TITLE: Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan
#+SUBTITLE: User's Guide @@latex:\\@@ @@html:<br>@@ (Torsten Version 0.90.0, Stan version 2.29.2)
#+LATEX_CLASS: amsbook
#+LATEX_CLASS_OPTIONS: [12pt, reqno, oneside]

# title page
#+LATEX_HEADER: \newcommand\subtitle[1]{\newcommand\mrgsubtitle{#1}}
#+LATEX_HEADER: \newcommand\mrgproject{}
#+LATEX_HEADER: \newcommand\mrgtitle{Torsten: A Pharmacokinetic/Pharmacodynamic Model Library for Stan}
#+LATEX_HEADER: \newcommand\mrgsubtitle{\large{User's Guide} \linebreak (Torsten Version 0.90.0, Stan version 2.29.2)}
#+LATEX_HEADER: \include{mrgtitlepage}

# make index
#+LATEX_HEADER: \usepackage{imakeidx}
#+LATEX_HEADER: \makeindex

#+LATEX_HEADER: \usepackage[letterpaper, width=6.5in, height=9in]{geometry}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{pdfpages}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{epstopdf}

# define MRG branding color
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{MRGGreen}{rgb}{0, 0.350, 0.200}
#+LATEX_HEADER: \usepackage[colorlinks=true, citecolor=MRGGreen, urlcolor=MRGGreen, linkcolor=MRGGreen]{hyperref}

#+LATEX_HEADER: \usepackage{bold-extra}
#+LATEX_HEADER: \usepackage{courier}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[framemethod=TikZ, skipabove=10pt, skipbelow=10pt, backgroundcolor=black!3, roundcorner=4pt, linewidth=1pt]{mdframed}
#+LATEX_HEADER: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER: \AfterEndEnvironment{minted}{\end{mdframed}}

#+LATEX_HEADER: \usepackage{subcaption}

# remove "chapter" in chapter name
#+LATEX_HEADER: \renewcommand{\chaptername}{}
#+LATEX_HEADER: \numberwithin{equation}{chapter}
#+LATEX_HEADER: \numberwithin{figure}{chapter}
#+LATEX_HEADER: \numberwithin{table}{chapter}

#+LATEX_HEADER: \usepackage[section]{placeins}

# section numbering begins with chapter
* Changelog
    :PROPERTIES:
    :EXPORT_FILE_NAME: Changelog
    :EXPORT_HUGO_MENU: :menu "main"
    :EXPORT_OPTIONS: toc:t num:nil
    :EXPORT_DATE: <2022-05-18 Wed>
    :END:
- Version 0.90.0 <2022-05-18 Wed>
  + Changed
    - Update model examples according to new array syntax.
    - Update to Stan version 2.29.2.
- Version 0.89 <2021-06-15 Tue>
  + Changed
    - New backend for ODE events solvers.
    - Use vector instead of array as ODE function state & return type.
    - Simplified ODE integrator naming, e.g. =pmx_ode_bdf[_ctrl]=.
    - Update to Stan version 2.27.0.
- Version 0.88 <2020-12-18 Fri>
  + Added
    - Bioavailability, lag time, ODE real & integer data are optional in PMX function signatures.
    - Support all EVID options from NM-TRAN and mrgsolve.
    - Support steady-state infusion through multiple interdose intervals.
  # - Experimental feature of cross-chain warmup and multilevel MPI paralleism.
  + Changed
    - More efficient memory management of COVDES implenmentation.
    - Update of MPI framework to adapt multilevel paralleism.
    - Update to Stan version 2.25.0.
    - Use cmdstanr as R interface.
    - Stop supporting rstan as R interface.
- Version 0.87 <2019-07-26 Fri>
  + Added
    - MPI dynamic load balance for Torsten's population ODE integrators
      + src_stan[:exports code]{pmx_integrate_ode_group_adams}
      + src_stan[:exports code]{pmx_integrate_ode_group_bdf}
      + src_stan[:exports code]{pmx_integrate_ode_group_rk45}
      To invoke dynamic load balance instead of default static
      balance for MPI, issue =TORSTEN_MPI=2= in =make/local=.
    - Support =RATE= as parameter in src_stan[:exports code]{pmx_solve_rk45/bdf/adams}
      functions.
  + Changed
    - Some fixes on steady-state solvers
    - Update to rstan version 2.19.2.
- Version 0.86 <2019-05-15 Wed>
  + Added
    - Torsten's ODE integrator functions
      + src_stan[:exports code]{pmx_integrate_ode_adams}
      + src_stan[:exports code]{pmx_integrate_ode_bdf}
      + src_stan[:exports code]{pmx_integrate_ode_rk45}
      and their counterparts to solve a population/group of
      subjects governed by an ODE
      + src_stan[:exports code]{pmx_integrate_ode_group_adams}
      + src_stan[:exports code]{pmx_integrate_ode_group_bdf}
      + src_stan[:exports code]{pmx_integrate_ode_group_rk45}
    - Torsten's population PMX solver functions for general
      ODE models
      + src_stan[:exports code]{pmx_solve_group_adams}
      + src_stan[:exports code]{pmx_solve_group_bdf}
      + src_stan[:exports code]{pmx_solve_group_rk45}
    - Support time step =ts= as parameter in src_stan[:exports code]{pmx_integrate_ode_xxx}
      solvers.
  + Changed
    - Renaming Torsten functions in previous releases, the
      old-new name mapping is
      + src_stan[:exports code]{PKModelOneCpt} \rightarrow src_stan[:exports code]{pmx_solve_onecpt}
      + src_stan[:exports code]{PKModelTwoCpt} \rightarrow src_stan[:exports code]{pmx_solve_onecpt}
      + src_stan[:exports code]{linOdeModel} \rightarrow src_stan[:exports code]{pmx_solve_linode}
      + src_stan[:exports code]{generalOdeModel_adams} \rightarrow src_stan[:exports code]{pmx_solve_adams}
      + src_stan[:exports code]{generalOdeModel_bdf} \rightarrow src_stan[:exports code]{pmx_solve_bdf}
      + src_stan[:exports code]{generalOdeModel_rk45} \rightarrow src_stan[:exports code]{pmx_solve_rk45}
      + src_stan[:exports code]{mixOde1CptModel_bdf} \rightarrow src_stan[:exports code]{pmx_solve_onecpt_bdf}
      + src_stan[:exports code]{mixOde1CptModel_rk45} \rightarrow src_stan[:exports code]{pmx_solve_onecpt_rk45}
      + src_stan[:exports code]{mixOde2CptModel_bdf} \rightarrow src_stan[:exports code]{pmx_solve_twocpt_bdf}
      + src_stan[:exports code]{mixOde2CptModel_rk45} \rightarrow src_stan[:exports code]{pmx_solve_twocpt_rk45}
      Note that the new version of the above functions return
      the /transpose/ of the matrix returned by the old
      versions, in order to improve memory efficiency. The old version are retained but will be
      deprecated in the future. 
    - Update to Stan version 2.19.1.

- Version 0.85 <2018-12-04 Tue>
  + Added
    - Dosing rate as parameter
  + Changed
  - Update to Stan version 2.18.0.

- Version 0.84 <2018-02-24>
  + Added
    - Piecewise linear interpolation function.
    - Univariate integral functions.
  + Changed
    - Update to Stan version 2.17.1.
    - Minor revisions to User Manual.
    - Bugfixes.
- Version 0.83 <2017-08-02>
  + Added
    - Work with TorstenHeaders
    - Each chain has a different initial estimate
  + Changed
    - User manual
    - Fix misspecification in ODE system for TwoCpt example.
    - Other bugfixes
- Version 0.82 <2017-01-29>
  + Added
    - Allow parameter arguments to be passed as 1D or 2D arrays
    - More unit tests
    - Unit tests check automatic differentiation against finite differentiation.
  + Changed
    - Split the parameter argument into three arguments: pMatrix
      (parameters for the ODEs -- note: for =linOdeModel=, pMatrix
      is replaced by the constant rate matrix K), biovar
      (parameters for the biovariability), and tlag (parameters
      for the lag time).
    - bugfixes
- Version 0.81 <2016-09-27>
  + Added
    - linCptModel (linear compartmental model) function
- Version 0.80a <2016-09-21 Wed>
  + Added
    - check\under{}finite statements in pred\under{}1 and pred\under{}2 to reject metropolis proposal if initial conditions are not finite

